

% =========================================================================
%
%                      球谐函数
%
%
% =========================================================================
%
%　(C)2019-2020 广州海格通信有限公司
%   版本：V1.0
%   日期：2019年8月2日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能:  1.天线角度
%        2.
%        3.
%        4.
%        5.
%        6.
%--------------------------------------------------------------------------
clear;
Nx = 16;
Ny = 32;
lamda = 1;
k   = 2*pi/lamda;
dx  = 0.5*lamda;
dy  = dx;

I = 1;
% sita = 30/180*pi;
% fai  = 60/180*pi;

for sitainx = 1:90
    for faiinx = 1:90
        sita = sitainx/180*pi;
        fai  = faiinx/180*pi;
        S = 0;
        for m = 0:Nx - 1
            for n = 0:Ny - 1
                S = S + I*exp( 1j*k*( m*dx*cos(fai)+n*dy*sin(fai) )*sin(sita) );
            end
        end
        SS(sitainx,faiinx) = S;
    end
end

mesh(1:90,1:90,10*log10(abs(SS)))
% pcolor(1:90,1:90,(abs(SS)));
colorbar


