





% =========================================================================
%
%                         测试函数可用性
%
%
% =========================================================================
%
%　(C)2019-2020 广州海格通信有限公司
%   版本：V1.5
%   日期：2019年7月30日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能:  1.验证大地坐标系与GWS坐标系之间的相互转换
%        2.经度 L 为什么需要减180？
%        3.建立地球表面坐标系
%        4.
%        5.
%        6.经验证，模型没有问题
%--------------------------------------------------------------------------
clear all
% **************地球参数：WGS84坐标系的参数************************

rE     = 6378.137*1e3;      % 地球半径
eE2    = 0.00669437999013;  % 地球离心率的平方
a   = 6378137;              % 半长轴
f   = 1/298.257223563;      % 扁率
b   = a*(1-f);              % 半短轴
e   = sqrt(a^2 -b^2)/a;     % 离心率 

% **************终端参数************************
hX = 1;
B_bj = (39+48/60)*pi/180;            % 纬度
L_bj = (0 +28/60 - 180)*pi/180;      % 经度
% **************LBH坐标系-->WGS坐标系************************
N  = rE / sqrt( 1 - eE2*sin( B_bj )^2 );
x_bj = (N+hX)*cos(B_bj)*cos(L_bj);
y_bj = (N+hX)*cos(B_bj)*sin(L_bj);
z_bj = (N*(1-eE2)+hX)*sin(B_bj);
rXGZ = [x_bj;y_bj;z_bj];     % 从地心到信关站的矢量
% **************WGS坐标系-->LBH坐标系************************
[B,L,H] = XYZtoBLH(rXGZ(1),rXGZ(2),rXGZ(3));

% ***************扁率对于角度的影响***********************************
xbiy = 1.5;
sita1 = (  atan(-b^2/a^2*xbiy) - atan(-1*xbiy)  )/pi*180;
% ***************** 地面坐标系 (画出切线的方向) ****************************
wgs_surface = [cos(L_bj)*sin(B_bj)   sin(L_bj)*sin(B_bj)    -cos(B_bj);
                -sin(L_bj)               cos(L_bj)           0        ;
               cos(L_bj)*cos(B_bj)   sin(L_bj)*cos(B_bj)    sin(B_bj)]';
           
wgs_surface = wgs_surface*diag([-1,1,1]);
rE     = 6378.137*1e3;      % 地球半径
% r_bar = satPosECEF;
figure;
% plot3(r_bar(1,:),r_bar(2,:),r_bar(3,:),'r','LineWidth',1);
hold on;plot3(rXGZ(1),rXGZ(2),rXGZ(3),'*');grid on;hold on;
[Xe,Ye,Ze] = sphere(24);
Xe = rE*Xe;     Ye = rE*Ye;     Ze = rE*Ze;
surf(Xe,Ye,Ze); axis equal;     
% hold on;
% plot3([0,1.8*rXGZ(1)],[0,1.8*rXGZ(2)],[0,1.8*rXGZ(3)],'LineWidth',2.5,'Color','b');
%
hold on;
v1 = [0,0,10e6]';
v2 = wgs_surface*v1;
vtp = v2  + rXGZ;
plot3([rXGZ(1),vtp(1)],[rXGZ(2),vtp(2)],[rXGZ(3),vtp(3)],'LineWidth',2.5,'Color','b');



