
 % =========================================================================
%
%                      导航卫星位置速度解算
% 
%
% =========================================================================
%
%　(C)2019-2020 广州海格通信有限公司
%   版本：V1.0 
%   日期：2019年7月24日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能:  1.使用北斗的星历数据，画出北斗卫星的飞行轨迹
%        2. 
%        3. 
%        4. 
%        5.
%        6.
%--------------------------------------------------------------------------

clear all;
close all;
%---------------------读取RINEX格式n文件--------------------------------
data = RinexNreader('BR.16n','G01'); % 注意读取路径和卫星编号
%---------------------计算测量日的周积秒---------------------------------
[JD,FOD,GPSW,SOW,DOY,DOW] = GCtoGPS(data(1,1),data(2,1),data(3,1),data(4,1),data(5,1),data(6,1)); 
t0 = SOW; % SOW-周积秒
%-----------------------计算卫星坐标------------------------------------
i = 1;
for t = t0:1*60:(t0+86400) 
    % 从 t0 到 t0+86400秒(1天) 间隔 60秒(1min)，决定轨迹疏密
    [satPosECEF(:,i) , rECI(:,i) ] = orbitDetermine(data,t);
    % 输入:卫星PRN编号、时刻t
    % 输出:卫星WGS-84坐标x、y、z
    [B_ECEF(i),L_ECEF(i)] = XYZtoBLH(satPosECEF(1,i),satPosECEF(2,i),satPosECEF(3,i));
    % XYZtoBLH - 将卫星坐标的XYZ形式变为BLH形式，东经为正，西经为负，北纬为正，南纬为负
    i = i + 1;
end
% geoshow('landareas.shp','FaceColor', [0.15 0.5 0.15]),hold on % 绘制底图地球 
figure;
plot(L_ECEF,B_ECEF,'r.'); % 绘制坐标
grid on;
title('卫星飞行轨迹');
xlabel('经度 rad');
ylabel('纬度 rad');

% -----------画图----------------------------
rE     = 6378.137*1e3;      % 地球半径
r_bar = satPosECEF;
figure(1);plot3(r_bar(1,:),r_bar(2,:),r_bar(3,:),'r','LineWidth',1);
hold on;plot3(0,0,0,'*');grid on;
hold on;
[Xe,Ye,Ze] = sphere(24);
Xe = rE*Xe;
Ye = rE*Ye;
Ze = rE*Ze;
surf(Xe,Ye,Ze)
axis equal;
% ---------------------------------------------
figure;
plot(rECI(1,:),rECI(2,:))


%% 速度

v = satPosECEF(:,2:end)-satPosECEF(:,1:end-1);







